%%%-------------------------------------------------------------------
%%% @author lycaon
%%% @copyright (C) 2015, <COMPANY>
%%% @doc
%%% テスト用のユーティリティを集めたファイル
%%% @end
%%% Created : 27. 1 2015 0:03
%%%-------------------------------------------------------------------
-author("lycaon").

%%--------------------------------------------------------------------
%% @doc
%% フェイクプロセスを生成する
%% @end
%%--------------------------------------------------------------------
spawnFakeProcess() ->
  spawn(fun Me() -> receive Any -> io:format("Fake:~p~n", [Any]), Me() end end).

%%--------------------------------------------------------------------
%% @doc
%% 受け取ったメッセージをエコーするプロセス
%% @end
%%--------------------------------------------------------------------
spawnFakeEchoProcess(Pid) ->
  spawn(fun Me() -> receive Any -> io:format("FakeEcho:~p~n", [Any]), Pid ! Any, Me() end end).

%%--------------------------------------------------------------------
%% @doc
%% ニセのPUIDを生成する
%% @end
%%--------------------------------------------------------------------
spawnFakePlayerUid() ->
  {spawnFakeProcess(), make_ref()}.

%%--------------------------------------------------------------------
%% @doc
%% ニセのPUIDを生成する
%% @end
%%--------------------------------------------------------------------
spawnFakeEchoPlayerUid(Pid) ->
  {spawnFakeEchoProcess(Pid), make_ref()}.
