%%%-------------------------------------------------------------------
%%% @author lycaon
%%% @copyright (C) 2014, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 12. 8 2014 11:23
%%%-------------------------------------------------------------------
-module(mmmario).
-behaviour(application).
-author("lycaon").

%% API
-export([
  start/2,
  stop/1,
  new_player/2,
  exit_player/1
]).

%%--------------------------------------------------------------------
%% @doc
%% 全ての親であるmmmarioスーパーバイザーを開始する
%% @end
%%--------------------------------------------------------------------
start(_StartType, _StartArgs) ->
  mmmario_sup:start_link().

%%--------------------------------------------------------------------
%% @doc
%% 停止。でも何もしない
%% @end
%%--------------------------------------------------------------------
stop(_State) ->
  ok.

%%--------------------------------------------------------------------
%% @doc
%% 新しいプレイヤー
%% PUid :: {pid(), ref()} を返す
%% @end
%%--------------------------------------------------------------------
new_player(WSServPid, Name) ->
  {ok, PPid} = mmmario_player_sup:start_player(WSServPid, Name),
  {ok, mmmario_player:puid(PPid)}.

%%--------------------------------------------------------------------
%% @doc
%% プレイヤーを終了
%% @end
%%--------------------------------------------------------------------
exit_player(PUid) ->
  {PPid, _} = PUid,
  mmmario_player_sup:exit_player(PPid).
